projects/toroidal-rov-thruster/prototype1D_1B14_openFOAM/prototype1D_1B14_v2412/constant/turbulenceProperties
FoamFile { format ascii; class dictionary; object turbulenceProperties; }
simulationType RAS;
RAS { RASModel kOmegaSST; turbulence on; printCoeffs on; }

