projects/toroidal-rov-thruster/prototype1D_1B14_openFOAM/prototype1D_1B14_v2412/constant/MRFProperties
FoamFile { format ascii; class dictionary; object MRFProperties; }
MRF1 { cellZone mrfZone; active yes; nonRotatingPatches (duct inlet outlet farfield); origin (0 0 0); axis (1 0 0); omega 314.159265359; }

