projects/toroidal-rov-thruster/prototype1D_1B14_openFOAM/prototype1D_1B14_v2412/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// The cells that spin with the rotor (the MRF zone).
// Radius 51 mm sits between the rotor envelope (49.4 mm) and the duct throat
// (52 mm); x = -16.5..16.5 mm covers the whole rotor including the hub ends
// (-15..15 mm). scripts/validate_geometry.py checks these margins before meshing.

actions
(
    {
        name    mrfZone;
        type    cellZoneSet;
        action  new;
        source  cylinderToCell;
        p1      (-0.0165 0 0);
        p2      ( 0.0165 0 0);
        radius  0.051;
    }
);
